ERP.belugaerp/src/InformationRegisters/СоответствиеНоменклатурыЕГАИС/СоответствиеНоменклатурыЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоответствиеНоменклатурыЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Справка2</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/СоответствиеНоменклатурыЕГАИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура бг_ОчиститьСоответствиеНоменклатурыЕГАИС(СооответствияНоменклатурыЕГАИС) Экспорт
	Для Каждого СтрокаСоответствие Из СооответствияНоменклатурыЕГАИС Цикл
		НаборЗаписей = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.АлкогольнаяПродукция.Установить(СтрокаСоответствие.АлкогольнаяПродукция);
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаСоответствие.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(СтрокаСоответствие.Характеристика);
		НаборЗаписей.Отбор.Серия.Установить(СтрокаСоответствие.Серия);
		НаборЗаписей.Отбор.Справка2.Установить(СтрокаСоответствие.Справка2);
		
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
